
/* AppController */
"BetterZip will only run on macOS 10.10 (Yosemite) or later systems." = "BetterZip funziona solo su macOS 10.10 (Yosemite) o successivi.";
"Quit!" = "Esci!";
"Sorry!" = "Spiacente!";
"https://macitbetter.com/contact" = "mailto:betterzip@macitbetter.com";
"https://macitbetter.com/" = "https://macitbetter.com/";
"http://www.win-rar.com/" = "http://www.win-rar.com/";

/* helpers */
"Last modified: %@\nSize: %@" = "Ultima modifica: %@\nDimensioni: %@";

/* ReplaceExistingFiles */
"An item named %@ already exists in this location. Do you want to replace it with the one you are extracting?" = "Un elemento nominato %@ esiste già in questa posizione. Vuoi sostituirlo con quello che stai estraendo?";
"An item named %@ already exists in this location inside the archive. Do you want to replace it with the one you are adding?" = "Un elemento nominato %@ esiste già in questa posizione all'interno dell'archivio. Vuoi sostituirlo con quello che stai aggiungendo?";
"File in archive:" = "File nell'archivio:";
"File on disc:" = "File su disco:";

/* ZipDocument */
"Zip Format (recommended)" = "Formato Zip (consigliato)";
"TAR Format, uncompressed (tar)" = "Formato TAR, non compresso (tar)";
"TAR Format, GZip compressed (tgz)" = "Formato TAR, GZip compresso (tgz)"; 
"TAR Format, BZip2 compressed (tbz)" = "Formato TAR, BZip2 compresso (tbz)";
"7-Zip Format (best compression)" = "Formato 7-Zip (compressione migliore)";
"RAR Format" = "Formato RAR";
"Extract All" = "Estrai Tutto";
"Extract all files and folders from the archive" = "Estrai tutti i file e le cartelle dall'archivio";
"Extract" = "Estrai";
"Extract the selected files or folders from the archive" = "Estrai file o cartelle selezionati dall'archivio";
"Extracting archive: %@" = "Estrazione archivio: %@";
"Opening archive with %d items. Ugh, this is going to take a while..." = "Apertura archivio con %d elementi. Uffa, ci vorrà un pò...";
"Opening archive with %d items" = "Apertura archivio con %d elementi";
"Check for updates on startup?" = "Controlla gli aggiornamenti all'avvio?";
"Would you like %@ to check for updates on startup? You can initiate the check manually from the preferences window at any time." = "Vuoi %@ controllare gli aggiornamenti all'avvio? Puoi avviare manualmente il controllo delle preferenze in qualsiasi momento.";
"Yes" = "Si";
"No" = "No";
"Are you sure you want to overwrite the original archive?" = "Sei sicuro di voler sovrascrivere l'archivio originale?";
"Warning: Saving cannot be undone" = "Attenzione: il salvataggio non può essere annullato";
"Save" = "Salva";
"Don't Save" = "Non salvare";
"Saving archive: %@ of %@" = "Salvataggio archivio:: %@ di %@";
"Extracting items from archive: %@ of %@" = "Estrazione elementi dall'archivio: %@ di %@";
"Add" = "Aggiungi";
"Open" = "Apri";
"Add Items" = "Aggiungi Elementi";
"Extract Here" = "Estrai Qui";
"Warning" = "Avviso";
"%@ is not handled by any application. Try to extract the file and use Finder to open it." = "%@ non è gestito da alcuna applicazione. Prova ad estrarre il file e usa il Finder per aprirlo.";
"OK" = "OK";
"Delete Items" = "Elimina elementi";
"You can't move an item into one of its subfolders!" = "Non puoi spostare un elemento in una delle sue sottocartelle!";
"Move Items" = "Sposta elementi";
"BetterZip will now remove Mac specific files from the archive." = "BetterZip rimuoverà ora i file specifici per Mac dall'archivio.";
"Clean now" = "Pulisci ora";
"Cancel" = "Annulla";
"Clean Archive" = "Pulisci Archivio";
"Change Archive Mode" = "Cambia Modalità di Archiviazione";
"Archive" = "Archivio";
"Add to %@..." = "Aggiungi a %@...";
"Extract All..." = "Estrai tutto...";
"Extract Selected..." = "Estrai selezionati...";
"Save the archive" = "Salva l'archivio";
"Add a new file or folder to the archive" = "Aggiungi un nuovo file o cartella all'archivio";
"Extract files or folders from the archive" = "Estrai file o cartelle dall'archivio";
"View" = "Vista";
"View the selected file" = "Visualizza il file selezionato";
"Delete" = "Elimina";
"Delete the selected files or folders from the archive" = "Elimina file o cartelle selezionati dall'archivio";
"Search" = "Cerca";
"Search the archive file" = "Cerca il file archivio";
"Clean" = "Pulisci";
"Stop" = "Ferma";
"Ignore and go on" = "Ignora e vai avanti";
"The file %@ could not be added to the archive. Maybe the system disc is full?" = "Il file %@ non può essere aggiunto all'archivio. Forse il disco di sistema è pieno?";
"There is not enough free space on the destination drive." = "Non c'è abbastanza spazio libero nell'unità di destinazione.";
"Loading archive: %@" = "Caricamento archivio: %@";
"External command returned: %d\n" = "Comando esterno restituito: %d\n";
"Saving archive failed" = "Salvataggio archivio non riuscito";
"You don't have permission to write to this folder." = "Non hai il permesso per scrivere in questa cartella.";
"An unknown error occurred." = "Si è verificato un errore sconosciuto.";
"New Folder" = "Nuova Cartella";
"Create New Folder" = "Crea Nuova Cartella";
"Error" = "Errore";
"Create a new folder in the selected place inside the archive." = "Crea una nuova cartella nella posizione selezionata all'interno dell'archivio.";
"An item with this name already exists in this folder!" = "Un elemento con questo nome esiste già in questa cartella!";
"Do you want to save the changes you made in the document %@?" = "Vuoi salvare le modifiche apportate nel documento %@?";
"Your changes will be lost if you don't save them." = "Le modifiche andranno perse se non le salvi.";
"The archive extraction failed." = "L'estrazione dell'archivio non è riuscita.";
"Maybe, there is not enough free space on the destination drive. Or the password is incorrect." = "Forse, non c'è abbastanza spazio libero sul disco di destinazione. Oppure la password non è corretta.";
"Rename Item" = "Rinomina elemento";
"Opening archive failed" = "Apertura archivio nn riuscita";
"Not encrypted" = "Non criptato";
"Weak (PKZip2 compatible)" = "Debole (compatibile PKZip2)";
"Strong (AES-256)" = "Forte (AES-256)";
"untitled folder" = "Cartella senza titolo";
"BetterZip Temporary Folder" = "BetterZip cartella temporanea"; 
"(incl. %d hidden)" = "(incl. %d nascosto)";
"%d selected, uncompressed size: %@ %@" = "%d selezionato, dimensioni non compresse: %@ %@";
"%d items, uncompressed size: %@ %@" = "%d elementi, dimensioni non compresse: %@ %@";
"%d item, uncompressed size: %@ %@" = "%d elemento, dimensione non compressa: %@ %@";
"BetterZip will now remove one file matching the patterns configured in the preferences window from the archive." = "BetterZip rimuoverà un file corrispondente ai pattern configurati nella finestra delle preferenze dall'archivio.";
"BetterZip will now remove %d files matching the patterns configured in the preferences window from the archive." = "BetterZip ora rimuoverà %d file corrispondenti ai pattern configurati nella finestra delle preferenze dall'archivio.";
"BetterZip will now remove one Mac specific file from the archive." = "BetterZip rimuoverà un file specifico per Mac dall'archivio.";
"BetterZip will now remove %d Mac specific files from the archive." = "BetterZip ora rimuoverà %d file specifici per Mac dall'archivio.";
"Remove" = "Rimuovi";
"BetterZip cannot extract to this folder. Maybe you don't have write access." = "BetterZip non può estrarre in questa cartella. Forse non hai accesso in scrittura.";
"Save As..." = "Salva Come...";
"Save the archive with another name." = "Salva l'archivio con un altro nome.";
"Cleaning" = "Pulizia";
"No compression" = "Nessuna compressione"; 
"Fast, but larger archives" = "Veloce, ma archivi più grandi";
"Normal" = "Normale";
"Best, but slower operation" = "Migliore, ma operazione più lenta";
"Remove files matching the patterns configured in the preferences window from the archive." = "Rimuovi i file corrispondenti ai pattern configurati nella finestra delle preferenze dall'archivio.";
"File Types" = "Tipi di file";
"N/A" = "N/A";
"Multiple files" = "File multipli";
"No files selected" = "Nessun file selezionato";
"A volume is missing: /%s." = "Manca un volume: /%s.";
"Close" = "Chiudi";
"Strong (AES-256) with header encryption" = "Forte (AES-256) con crittografia di intestazione";


/* PreferenceController */
"Last checked: " = "Ultimo controllo:";
"General" = "Generali";
"Columns" = "Colonne";
"Advanced" = "Avanzate";
"Helpers" = "Assistenti";
"Use RAR" = "Usa RAR";
"Never" = "Mai";
"never" = "mai";
"Next to original" = "Accanto all'originale";


/* V 2.0 */
"Cancel the operation" = "Annulla l'operazione";
"Reveal in Finder" = "Mostra nel Finder";
"Passwords" = "Password";
"no errors" = "nessun errore";
"with errors" = "con errori";
"cancelled" = "annullato";
"Extracted %@" = "Estratto %@";
"Extracting %@" = "Estrazione %@";
"Compressing %@" = "Compressione %@";
"Extracting items temporarily" = "Estrazione elementi temporaneamente";
"%@ of %@" = "%@ di %@";
"%@ copy" = "%@ copia";
"Extract to..." = "Estrai in...";
"The archive could not be extracted completely. It may be damaged." = "L'archivio non può essere estratto completamente. Potrebbe essere danneggiato";
"This archive appears to be damaged." = "Questo archivio sembra essere danneggiato.";
"The archive could not be extracted." = "L'archivio non può essere estratto.";
"It is either damaged or in an unsupported format." = "Danneggiato o formato non supportato.";
"BetterZip Recovered Files" = "BetterZip File Recuperati";
"Multiple Copies Installed" = "Copie Multiple Installate";
"Quit and Reveal in Finder" = "Esci e mostra nel Finder";
"Queued for extraction" = "In coda per l'estrazione";
"Queued for compression" = "In coda per la compressione";
"The archive tests failed." = "Verifiche dell'archivio non riuscite";
"The archive is either damaged or in an unsupported format." = "L'archivio è danneggiato o in un formato non supportato.";
"Test" = "Verifica";
"Testing: %@\n" = "Verifica: %@\n";
"Test the archive" = "Verifica l'archivio";
"Running script" = "Script in esecuzione";
"Show Favorites" = "Mostra Preferiti";
"Hide Favorites" = "Nascondi Preferiti";
"Show Preview" = "Mostra Anteprima";
"Hide Preview" = "Nascondi Anteprima";
"<new password>" = "<nuova password>";
"The transcript window may contain further details." = "La finestra di trascrizione può contenere ulteriori dettagli.";
"The file %@ has been modified." = "Il file %@ è stato modificato..";
"Do you want to save the changes back to the archive?" = "Vuoi salvare le modifiche nell'archivio?";
"Update File" = "Aggiorna file";
"Ignore Changes" = "Ignora Modifiche";
"Ignore This Time" = "Ignora questa volta";
"Symbolic Link (no preview possible)" = "Link Simbolico (nessuna anteprima possibile)";
"Use for subsequent archives" = "Usa per archivi successivi";
"Use this password for the new archive" = "Usa questa password per il nuovo archivio";
"This is not the password you are looking for." = "Questa non è la password che stai cercando.";
"Edit Presets..." = "Modifica Presets...";
"Show save panel" = "Mostra pannello di salvataggio";
"XAR Format" = "Formato XAR";
"Presets" = "Preset";
"Testing archive %@" = "Verifica archivio %@";
"Archive test successful" = "Verifica archivio riuscita";
"The archive test was completed successfully." = "La verifica dell'archivio è stata completato con successo.";
"Today" = "Oggi";
"Yesterday" = "Ieri";
"Go to the win.rar GmbH web site" = "Vai al sito web win.rar GmbH";
"Extracting items from %@" = "Estrazione elementi da %@";
"The rar helper could not be found." = "L'assistente rar non è stato trovato.";
"Please set the correct path in Preferences > Helpers or choose a different format for saving." = "Si prega di impostare il percorso corretto in Preferenze> Assistenti o scegliere un formato diverso per il salvataggio.";
"Merge Folders" = "Unisci Cartelle";
"Keep Both" = "Mantieni entrambi";
"Apply to all folders" = "Applica a tutte le cartelle";
"Apply to all" = "Applica a tutto";
"Do you want to extract the %d archives that were found inside the selected folders?" = "Vuoi estrarre i %d archivi trovati nelle cartelle selezionate?";
"To ignore the selected folders and only extract directly selected archives click “Extract Selected Only”." = "Per ignorare le cartelle selezionate e estrarre solo gli archivi selezionati direttamente, fai clic su \"Estrai solo selezionati\".";
"Extract Selected Only" = "Estrai solo i selezionati";
"Archive Creation Complete" = "Creazione dell'archivio completata";
"Archive Extraction Complete" = "Estrazione dell'archivio completata";
"All Queued Archive Operations Complete" = "Tutte le operazioni di archiviazione in coda completate";
"<new preset>" = "<nuovo preset>";
"Other folder..." = "Altra cartella...";
/* open with other application */
"Other..." = "Altro...";
"Compress" = "Comprimi";
"Saving archive %@" = "Salvataggio archivio %@";
"Compressed %@" = "Compresso %@";
"An error occurred" = "Si è verificato un errore";
"Use this preset as default in the toolbar" = "Usa questo preset come predefinito nella barra strumenti";
"Use this preset as service" = "Usa questo preset come servizio";

/* added in BetterZip 3 */
"Adding files to archive %@" = "Aggiunta dei file all'archivio";
"When in Direct Mode, all archive operations are immediate and cannot be undone." = "In Modalità Diretta, tutte le operazioni di archiviazione sono immediate e non possono essere annullate.";

/* the two possible labels of the action button in the "file replace" alert panel */
"Update" = "Aggiornamento";
"Replace" = "Sostituisci";

"An item named %@ already exists in this location inside the archive. Do you want to update it?" = "Un elemento nominato %@ esiste già in questa posizione all'interno dell'archivio. Vuoi aggiornarlo?";

"The archive cannot be created." = "L'archivio non può essere creato.";
"BetterZip will now remove one file matching your patterns from the archive." = "BetterZip ora rimuoverà un file corrispondente ai tuoi pattern dall'archivio.";
"BetterZip will now remove %d files matching your patterns from the archive." = "BetterZip ora rimuoverà %d file corrispondenti ai tuoi pattern dall'archivio.";
"After filtering, there are no files left to archive." = "Dopo aver filtrato, non ci sono file da archiviare.";
"macOS returned this error:" = "macOS ha restituito questo errore:";
"Use this pattern to specify which files and folders to add to the archive:" = "Usa questo pattern per specificare quali file e cartelle aggiungere all'archivio:";
"Add Files to Archive" = "Aggiungi i File all'archivio";
"Use this pattern to delete files and folders from the archive:" = "Usa questo pattern per eliminare file e cartelle dall'archivio:";
"Delete Files From Archive" = "Elimina File Dall'Archivio";

/* displayed in the file types table for user defined extensions */
"<Click to add your own>" = "<Clicca per aggiungere>";

/* new compression levels */
"High, but slower operation" = "Migliore, ma operazione lenta";
"Best (solid, slow extraction)" = "Migliore (solido, estrazione lenta)";

/* Preferences window - name of the tab to manage filter patterns */
"Filtering" = "Filtra";

/* Tooltip for the delete with pattern toolbar button */
"Delete with pattern" = "Elimina con pattern";

"<new pattern>" = "<nuovo pattern>";

/* warning when a user adds an archive comment, but the current format doesn’t support that (user can still save with an other format */
"You should save this archive with ZIP or RAR format or your comment will be lost." = "Dovresti salvare questo archivio con formato ZIP o RAR o il tuo commento andrà perso.";

/* possible button labels for setting and clearing passwords in the save presets configuration */
"Set" = "Imposta";
"Clear" = "Pulito";

"CPIO Format, uncompressed (cpio)" = "Formato CPIO, non compresso (cpio)";
"TAR Format, xz compressed (txz)" = "Formato TAR, xz compresso (txz)";

/* title of the OK button in the file open panel used to locate the temp folder or standard opening program */ 
"Use" = "Usa";

/* possible file status strings */
"Modified" = "Modificato";
"Moved" = "Spostato";
"Added" = "Aggiunto";
"Updated" = "Aggiornato";

"An error occurred opening %@. Do you want to try to open the archive anyway?" = "Si è verificato un errore durante l'apertura di %@. Vuoi provare ad aprire l'archivio comunque?";
"Cancel Opening" = "Annulla apertura";
"Open Anyway" = "Apri Comunque";

/* added in BetterZip 4 */

/* Default title for dynamic preset services */
"Compress with Preset %@" = "Comprimi con Preset %@";
"Extract with Preset %@" = "Estrai con Preset %@";
"Service Name" = "Nome Servizio";
"Comment Text" = "Testo del commento";

"Caution" = "Attenzione";
"Do not enable this option, if you are not in the habit of making regular backups of your data. BetterZip will not warn you before overwriting files, if you use a preset with the overwrite switch enabled. Files can be lost. Use at your own risk." = "Non abilitare questa opzione, se non ha l'abitudine di fare backup regolari dei dati. BetterZip non avviserà prima di sovrascrivere i file, se si utilizza un preset con l'opzione di sovrascrittura abilitata. I file possono essere persi. Usare a proprio rischio.";
"Activate" = "Attiva";
"Trash" = "Cestino";
"Don't move" = "Non spostare";
"+pwd" = "+pwd";
"Reload Drop Bar" = "Ricarica Barra Rilascio";

"The file %@ could not be extracted. %@\n\nThe last error macOS reported was:\n\"%s\"" = "Il file %@ non può essere estratto. %@\n\nL'ultimo errore di macOS riportato era:: \"%s\"";
"The password may be incorrect." = "La password potrebbe essere errata.";
"Archive Extraction Failed" = "Estrazione dell'archivio non riuscita";
"Archive Creation Failed" = "Creazione archivio non riuscita";
"Archive Test Successful" = "Verifica archivio riuscita";
"Archive Test Failed" = "Verifica archivio non riuscita";

"The archive disappeared" = "L'archivio è scomparso";
"You can still browse the contents, but all archive operations will fail. \nDo you want to close the window?" = "E' possibile sfogliare il contenuto, ma tutte le operazioni di archiviazione non riusciranno.\nVuoi chiudere la finestra?";
"Ignore" = "Ignora";

"An error occurred opening %@. Do you want to try to repair the archive?" = "Si è verificato un errore durante l'apertura di %@. Vuoi provare a riparare l'archivio?";
"The archive could not be extracted completely. It may be damaged. Do you want to try to repair the archive?" = "L'archivio non può essere estratto completamente. Potrebbe essere danneggiato. Vuoi provare a riparare l'archivio?";
"Repair" = "Ripara";
"%@ (damaged)" = "%@ (danneggiato)";

"Drag items here to compress or extract" = "Trascina qui gli elementi per comprimere o estrarre";
"Drop archives here to extract" = "Rilascia qui gli archivi per estrarre";
"Drop the archives here to open them" = "Rilascia gli archivi qui per aprirli";
"Drop items here to compress" = "Rilascia gli elementi per comprimere";
"Drop the files here to add them to a new archive" = "Rilascia qui i file per aggiungerli a un nuovo archivio";
"Choose from your favorite presets" = "Scegli tra i preset preferiti";
"Test the archive integrity" = "Verifica l'integrità dell'archivio";
"Open and browse the archive" = "Apri e sfoglia l'archivio";
"Add the items to a new archive" = "Aggiungi gli elementi a un nuovo archivio";
"Trash" = "Cestino";

"Compress with BetterZip" = "Comprimi con BetterZip";
"Extract with BetterZip" = "Estrai con BetterZip";

"Reveal in Finder" = "Mostra nel Finder";
"Cancel the operation" = "Annulla l'operazione";

"This archive doesn't contain any Mac specific files yet" = "Questo archivio non contiene ancora file specifici per Mac";
"Do you want to keep it that way or add metadata to your archive?" = "Vuoi lasciare com’è o aggiungere i metadati all’archivio?";
"Add Mac Stuff" = "Aggiungi materiale per Mac";
"Keep Mac Stuff out" = "Escludi materiale per Mac";

"System Default" = "Predefinito di Sistema";
"One password per line:" = "Una password per riga:";
"Back" = "Indiero";
"Unlock Password Manager…" = "Sblocca Password Manager…";
"Lock Password Manager" = "Blocca Password Manager";
"Archives" = "Archivio";
"Archive Types" = "Tipi di Archivio";
"Files" = "Ffile";
"Next to archive" = "Accanto all’archivio";
"Choose Master Password" = "Scegli Password Principale";
